test/stress/socket-load-test.yml
config:
  target: "https://demo-discord.onrender.com"

  phases:
    - name: warm-up
      duration: 30
      arrivalRate: 10

    - name: steady-load
      duration: 60
      arrivalRate: 20

    - name: stress
      duration: 60
      arrivalRate: 40

  engines:
    socketio:
      transports:
        - websocket
      ws: true
      path: /socket.io

  processor: "./user-generator.js"

scenarios:
  - name: mixed-chat-traffic
    engine: socketio
    flow:
      - function: pickUser

      - emit:
          channel: presence:online
          data:
            userId: "{{ userId }}"
            username: "{{ username }}"

      - loop:
          - emit: { channel: typing:start }
          - think: 0.3
          - emit: { channel: typing:stop }
          - think: 0.5
          - emit:
              channel: send-message
              data:
                userId: "{{ userId }}"
                username: "{{ username }}"
                content: "hello"
          - think: 1
        count: 5

      - think: 5