test/stress/socket-load-test.yml
config:
  target: "https://demo-discord.duckdns.org"
  engine: socketio

  socketio:
    transports:
      - websocket
    upgrade: false
    path: /socket.io

  phases:
    - name: warm-up
      duration: 30
      arrivalRate: 10

    - name: steady-load
      duration: 60
      arrivalRate: 20

    - name: stress
      duration: 60
      arrivalRate: 40

  processor: "./user-generator.js"

scenarios:
  - name: realistic-chat-traffic
    engine: socketio
    flow:

      - function: pickUser

      - emit:
          channel: presence:online
          data:
            userId: "{{ userId }}"
            username: "{{ username }}"

      - loop:
          - emit: { channel: typing:start }
          - think: 0.1
          - emit: { channel: typing:stop }

          - emit:
              channel: send-message
              data:
                userId: "{{ userId }}"
                username: "{{ username }}"
                content: "hello"

          - think: 0.3

        count: 10

      - think: 5