test/stress/socket-load-test.yml
config:
  target: "http://localhost:4000"

  engine: socketio

  socketio:
    transports:
      - websocket
    upgrade: false
    path: /socket.io

  phases:
    - duration: 60
      arrivalRate: 10

  processor: "./user-generator.js"

scenarios:
  - engine: socketio

    flow:

      - function: pickUser

      - emit:
          channel: presence:online
          data:
            userId: "{{ userId }}"
            username: "{{ username }}"

      - emit:
          channel: send-message
          data:
            userId: "{{ userId }}"
            username: "{{ username }}"
            content: "load-test"
          acknowledge:
            match:
              ok: true

      - loop:

          - emit:
              channel: send-message
              data:
                userId: "{{ userId }}"
                username: "{{ username }}"
                content: "load-test"
              acknowledge:
                match:
                  ok: true

          - think: 0.05

        count: 1000

        # https://demo-discord.duckdns.org